# LDevice_SetAccPos2D

## Description
Set the 2D position and rotation of the specified accessory.

```pascal
PROCEDURE LDevice_SetAccPos2D(
				handle         : HANDLE;
				cellIndex      : LONGINT;
				accessoryIndex : LONGINT;
				position       : REAL;
				rotation       : REAL);
```

```python

def vs.LDevice_SetAccPos2D(handle, cellIndex, accessoryIndex, position, rotation):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|cellIndex|LONGINT||
|accessoryIndex|LONGINT||
|position|REAL||
|rotation|REAL||

## Version
Availability: from Vectorworks 2021
## Category
* Spotlight